# Pandas

In [3]:
# Importar la biblioteca Pandas
import pandas as pd

# Crear un DataFrame con Pandas
data_pandas = {
    "nombre": ["Ana", "Luis", "María", "Juan", "Lucía"],
    "edad": [23, 45, 34, 25, 30],
    "ciudad": ["Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao"]
}
df_pandas = pd.DataFrame(data_pandas)

In [4]:
# Seleccionar una columna
df_pandas["nombre"]

0      Ana
1     Luis
2    María
3     Juan
4    Lucía
Name: nombre, dtype: object

In [5]:
# Filtrar por filas
df_pandas[df_pandas["edad"] > 30]

  nombre  edad     ciudad
1   Luis    45  Barcelona
2  María    34   Valencia

In [6]:
# Agregación de datos
df_pandas["edad"].mean()

31.4

In [7]:
# Ordenacion
df_pandas.sort_values(by="edad")

  nombre  edad     ciudad
0    Ana    23     Madrid
3   Juan    25    Sevilla
4  Lucía    30     Bilbao
2  María    34   Valencia
1   Luis    45  Barcelona

In [8]:
# Agregar una nueva columna
df_pandas["salario"] = [50000, 60000, 70000, 80000, 90000]
df_pandas

  nombre  edad     ciudad  salario
0    Ana    23     Madrid    50000
1   Luis    45  Barcelona    60000
2  María    34   Valencia    70000
3   Juan    25    Sevilla    80000
4  Lucía    30     Bilbao    90000

In [9]:
# Agrupar por ciudad y calcular la media de edad
print(df_pandas.groupby("ciudad")["edad"].mean())

ciudad
Barcelona    45.0
Bilbao       30.0
Madrid       23.0
Sevilla      25.0
Valencia     34.0
Name: edad, dtype: float64

# Polars

In [10]:
# Importar la biblioteca Polars
import polars as pl

# Crear un DataFrame con Polars
data_polars = {
    "nombre": ["Ana", "Luis", "María", "Juan", "Lucía"],
    "edad": [23, 45, 34, 25, 30],
    "ciudad": ["Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao"]
}
df_polars = pl.DataFrame(data_polars)

In [11]:
# Seleccionar una columna
df_polars.select("nombre")

shape: (5, 1)
┌────────┐
│ nombre │
│ ---    │
│ str    │
╞════════╡
│ Ana    │
│ Luis   │
│ María  │
│ Juan   │
│ Lucía  │
└────────┘

In [12]:
# Filtrar filas
df_polars.filter(pl.col("edad") > 30)

shape: (2, 3)
┌────────┬──────┬───────────┐
│ nombre ┆ edad ┆ ciudad    │
│ ---    ┆ ---  ┆ ---       │
│ str    ┆ i64  ┆ str       │
╞════════╪══════╪═══════════╡
│ Luis   ┆ 45   ┆ Barcelona │
│ María  ┆ 34   ┆ Valencia  │
└────────┴──────┴───────────┘

In [13]:
# Agregar datos
df_polars.select(pl.col("edad").mean())

shape: (1, 1)
┌──────┐
│ edad │
│ ---  │
│ f64  │
╞══════╡
│ 31.4 │
└──────┘

In [14]:
# Ordenar datos
df_polars.sort("edad")

shape: (5, 3)
┌────────┬──────┬───────────┐
│ nombre ┆ edad ┆ ciudad    │
│ ---    ┆ ---  ┆ ---       │
│ str    ┆ i64  ┆ str       │
╞════════╪══════╪═══════════╡
│ Ana    ┆ 23   ┆ Madrid    │
│ Juan   ┆ 25   ┆ Sevilla   │
│ Lucía  ┆ 30   ┆ Bilbao    │
│ María  ┆ 34   ┆ Valencia  │
│ Luis   ┆ 45   ┆ Barcelona │
└────────┴──────┴───────────┘

In [16]:
# Agregar una nueva columna
df_polars = df_polars.with_columns(pl.Series("salario", [50000, 60000, 70000, 80000, 90000]))

In [17]:
# Agrupar por ciudad y calcular la media de edad
df_polars.groupby("ciudad").agg(pl.col("edad").mean())

/tmp/ipykernel_916311/3800924131.py:2: DeprecationWarning: `groupby` is deprecated. It has been renamed to `group_by`.
  df_polars.groupby("ciudad").agg(pl.col("edad").mean())

shape: (5, 2)
┌───────────┬──────┐
│ ciudad    ┆ edad │
│ ---       ┆ ---  │
│ str       ┆ f64  │
╞═══════════╪══════╡
│ Madrid    ┆ 23.0 │
│ Barcelona ┆ 45.0 │
│ Bilbao    ┆ 30.0 │
│ Sevilla   ┆ 25.0 │
│ Valencia  ┆ 34.0 │
└───────────┴──────┘